//#define _CRT_SECURE_NO_WARNINGS 1
//#include<stdio.h>
//int main()
//{
//	//百度工程师面试题
//	//制作一个小的程序判断这个机器是大端字节序还是小端字节序
//	int a = 0x00000080;
//	char* b = (char*)&a;
//	printf("%x", *b);
//	if (*b == 0xffffff80)//出现了整形提升，详情见DUT1的操作符详解当大于80的时候前面补的就不是0而是1
//		//那么变成16进制打印的时候打印的就是1111111111111.....10000000的16进制
//		printf("小端");
//
//	return 0;
//}
//int check_sys()
//{
//	int a = 1;//精简包装  
//	return *(char*)&a;
//}
//#include<stdio.h>
//int main()
//{
//	char a = -1;//11111111111111111111111111111111111111
//	signed char b = -1;
//	unsigned char c = -1;//无符号11111111前面补00000000000000000
//	printf("a=%d,b=%d,c=%d", a, b, c);//-1 -1 255
//	return 0;
//}
//#include<stdio.h>
//int main()
//{
//	char a = -128;//4294967168
//	printf("%u\n", a);//%u是无符号整形输出
//	return 0;
//}
//分析1000000 00000000 00000000 10000000
//    1111111 11111111 11111111 01111111
//    1111111 11111111 11111111 10000000
//     补码取后8位10000000
//然后整形提升     1111111111111111111111111111100000000
//     %u无符号打印，那我们认为这个补码就是原码
//10000000这个1是符号位他的值是多少呢，假如是1000001这个就减一取反就是
//1是符号位不能借位，那么它被机器识别就直接为-128所以在char 的128和-128是一样的
//解释：假如用9个比特位来看1 1000 0000 
//                         1 0111 1111
//                         1 1000 0000你会发现这后八位就是-128
        
